examples/damBreak/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

restore0Dir
touch damBreak.foam
runApplication blockMesh
runApplication pyoftools setFields system/setFields.py
runApplication $(getApplication)

#------------------------------------------------------------------------------
